# Groupby Method

In [12]:
import pandas as pd
import numpy as np

In [16]:
team_data = {'company':['Apple','Apple','Fb','Fb','Google','Google'],
            'Person':['kashi','dinesh','bidur','arjun','sathke','ashok'],
            'Sales':[200,150,350,260,180,550]}

In [17]:
team_data

{'company': ['Apple', 'Apple', 'Fb', 'Fb', 'Google', 'Google'],
 'Person': ['kashi', 'dinesh', 'bidur', 'arjun', 'sathke', 'ashok'],
 'Sales': [200, 150, 350, 260, 180, 550]}

In [18]:
df = pd.DataFrame(team_data)

In [19]:
df

  company  Person  Sales
0   Apple   kashi    200
1   Apple  dinesh    150
2      Fb   bidur    350
3      Fb   arjun    260
4  Google  sathke    180
5  Google   ashok    550

In [22]:
b=df.groupby(by='company')

In [23]:
b.mean()

         Sales
company
Apple    175.0
Fb       305.0
Google   365.0

In [24]:
b.sum()

         Sales
company
Apple      350
Fb         610
Google     730

In [25]:
b.std()

              Sales
company
Apple     35.355339
Fb        63.639610
Google   261.629509

In [26]:
# for specific function
b.sum().loc['Apple']

Sales    350
Name: Apple, dtype: int64

In [27]:
df.groupby(by='company').sum()

         Sales
company
Apple      350
Fb         610
Google     730

In [28]:
df.groupby(by='company').sum().loc['Google']

Sales    730
Name: Google, dtype: int64

In [29]:
b.count()

         Person  Sales
company
Apple         2      2
Fb            2      2
Google        2      2

In [30]:
b.max()

         Person  Sales
company
Apple     kashi    200
Fb        bidur    350
Google   sathke    550

In [31]:
b.min()

         Person  Sales
company
Apple    dinesh    150
Fb        arjun    260
Google    ashok    180

In [32]:
# groupby method with describe function

df.groupby(by='company').describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
company
Apple     2.0  175.0   35.355339  150.0  162.5  175.0  187.5  200.0
Fb        2.0  305.0   63.639610  260.0  282.5  305.0  327.5  350.0
Google    2.0  365.0  261.629509  180.0  272.5  365.0  457.5  550.0

In [33]:
df.groupby(by='company').describe().transpose()

company           Apple         Fb      Google
Sales count    2.000000    2.00000    2.000000
      mean   175.000000  305.00000  365.000000
      std     35.355339   63.63961  261.629509
      min    150.000000  260.00000  180.000000
      25%    162.500000  282.50000  272.500000
      50%    175.000000  305.00000  365.000000
      75%    187.500000  327.50000  457.500000
      max    200.000000  350.00000  550.000000

In [34]:
df.groupby(by='company').describe().loc['Google']

Sales  count      2.000000
       mean     365.000000
       std      261.629509
       min      180.000000
       25%      272.500000
       50%      365.000000
       75%      457.500000
       max      550.000000
Name: Google, dtype: float64